# Assignment #9 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Tori Hogrebe
</br>
Date: 04/24/2025
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
- Created our own databases from scratch using MySQL Workbench and Python with SQLAlchemy on our local server and locally on our machine.
- Populated our databases with the data we cleaned at the start of the semester.
<br>

At this point, we have discussed all major statements used with SQL, but the possibilities are endless when it comes to data! Below we will explore some miscellaneous statements and tools that may be useful with your database.<br>

<br>

Read Chapter 7 & 10 in Getting Started with SQL by Thomas Nield available on Blackboard. <br>
A quick reference for SQL commands: https://www.w3schools.com/sql/default.asp <br>

Review the powerpoint and other readings specified on Blackboard in the Discussion Board.<br>

In the event your database does not meet the requirements below to answer the question, please use the database provided in Assignment #4 and #5. Remember to credit your data source, especially when posting your assignments to Github.<br>

Feel free to use your preferred library and method for the exploration below. Now that all of our data is loaded onto the MySQL Workbench server, you can even take the assignment a step further and complete it all within SQL without Jupyter Notebook!<br>

Follow the instructions below to complete the assignment. Be sure to comment **all** code and answer **all** questions in markdown for full credit. Please submit this assignment with a link to it posted to your Github.<br>

**Data origin:**

In [8]:
# Load necessary packages:
from sqlalchemy import create_engine, Column, String, Integer, Boolean, BigInteger, Float, text # Database navigation
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
import mysql.connector
import sqlite3 # A second option for working with databases
import pandas as pd # Python data manilpulation
import numpy as np # Populating our tables

In [12]:
engine = create_engine("mysql+mysqlconnector://root:milo200282@localhost/education_career_db")

In [14]:
# Write a query to list the table names of the database:
from sqlalchemy import text

query = text("""
    SHOW TABLES;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

  Tables_in_education_career_db
0                     academics
1               career_outcomes
2                        skills
3                      students

#### CASE Statements
Case statements are similar to the if-then-else statements in programming. The data that meets the case statements in the database will be returned. You start a CASE statement with the word CASE and conclude it with an END. Between those keywords, you specify each condition with a WHEN [condition] THEN [value], where the condition and the values are specified by you.

Nield, Thomas. Getting Started with SQL (p. 71). O'Reilly Media. Kindle Edition. <br>
<br>
Write your question you are answering with your data query. <br>
<br>
**Question:** How can we categorize studentsâ€™ University GPA as High, Medium, or Low?
<br>
**What tables are we joining? (If any):** academics only used

In [18]:
query = text("""
    SELECT 
        Student_ID,
        University_GPA,
        CASE 
            WHEN University_GPA >= 3.5 THEN 'High'
            WHEN University_GPA >= 2.5 THEN 'Medium'
            ELSE 'Low'
        END AS GPA_Category
    FROM academics;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

  Student_ID  University_GPA GPA_Category
0     S00001            3.96         High
1     S00002            3.63         High
2     S00003            2.63       Medium
3     S00004            2.81       Medium
4     S00005            2.48          Low

**CASE STATEMENT**
<br>
Write a second CASE statement!

Write your question you are answering with your data query. <br>
<br>
**Question:** Are students satisfied with their career outcome based on a satisfaction score?
<br>
**What tables are we joining? (If any):** only career_outcomes table used

In [26]:
query = text("""
    SELECT 
        Student_ID,
        Career_Satisfaction,
        CASE 
            WHEN Career_Satisfaction >= 8 THEN 'Very Satisfied'
            WHEN Career_Satisfaction >= 5 THEN 'Satisfied'
            ELSE 'Unsatisfied'
        END AS Satisfaction_Level
    FROM career_outcomes;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

  Student_ID  Career_Satisfaction Satisfaction_Level
0     S00001                    4        Unsatisfied
1     S00002                    1        Unsatisfied
2     S00003                    9     Very Satisfied
3     S00004                    7          Satisfied
4     S00005                    9     Very Satisfied

**CASE STATEMENT**
<br>
Write a third CASE statement!

Write your question you are answering with your data query. <br>
<br>
**Question:** How many job offers did students receive, and how can we classify their job prospects?
<br>
**What tables are we joining? (If any):** only career_outcomes table used

In [34]:
query = text("""
    SELECT
        Student_ID,
        Job_Offers,
        CASE
            WHEN Job_Offers >= 3 THEN 'Great Prospects'
            WHEN Job_Offers = 1 OR Job_Offers = 2 THEN 'Some Offers'
            ELSE 'No Offers'
        END AS Job_Prospects
    FROM career_outcomes;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

  Student_ID  Job_Offers    Job_Prospects
0     S00001           5  Great Prospects
1     S00002           4  Great Prospects
2     S00003           0        No Offers
3     S00004           1      Some Offers
4     S00005           4  Great Prospects

**NULL**
<br>
As with all data, NULL values are fields with no data. Null data can be useful to know with the INSERT INTO statement below.

Find the NULL data within your database. Write your question you are answering with your data query. <br>
<br>
**Question:**  Which students are missing a value for Career_Satisfaction?
<br>

In [ ]:
from sqlalchemy import text

query = text("""
    SELECT Student_ID, Career_Satisfaction
    FROM career_outcomes
    WHERE Career_Satisfaction IS NULL;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

**INSERT INTO**
<br>
You can insert new records into a table as needed using the INSERT INTO statement. If you choose to populate a table with certain records and not others, the rest of the fields will remain empty/NULL.
<br>
For INSERT INTO, we are not querying the database, instead we are ADDING to it. We do not need to use dbGetQuery(), but instead, dbExecute()!
<br><br>
**Objective:** Add a new student record to the `students` table.
<br>

In [40]:
from sqlalchemy import text

# 1. Define the INSERT statement
insert_query = text("""
    INSERT INTO students (Student_ID)
    VALUES ('S05001');
""")

# 2. Execute the INSERT inside a transaction
with engine.begin() as connection:
    connection.execute(insert_query)

# 3. Verify that the new record is there
verify = text("SELECT * FROM students WHERE Student_ID = 'S05001';")
with engine.connect() as connection:
    new_student = pd.read_sql(verify, connection)

new_student

  Student_ID
0     S05001

**MIN() and MAX()**
<br>
You can use these statements alone or in combination with the CASE statemts above.<br>
The IN operator in a WHERE clause lets you filter for multiple values at once. You can also exclude certain values by using the NOT IN operator.
<br>

**Question:** What is the highest starting salary among all students?
<br>
**What table(s) are we joining? (If any)** Only the `career_outcomes` table is used

In [43]:
from sqlalchemy import text

query = text("""
    SELECT MAX(Starting_Salary) AS Highest_Starting_Salary
    FROM career_outcomes;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result

   Highest_Starting_Salary
0                 101000.0

Combine CASE statement with Min() and Max() for a more detailed query of your data:
<br><br>
**Question:** What is the maximum starting salary, and how would it be categorized?
<br>
**What table(s) are we joining?** Only the `career_outcomes` table is used.

In [48]:
from sqlalchemy import text

query = text("""
    SELECT 
        MAX(Starting_Salary) AS Max_Salary,
        CASE
            WHEN MAX(Starting_Salary) >= 100000 THEN 'Very High'
            WHEN MAX(Starting_Salary) >= 70000 THEN 'High'
            ELSE 'Moderate or Low'
        END AS Salary_Category
    FROM career_outcomes;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result

   Max_Salary Salary_Category
0    101000.0       Very High

**MIN() and MAX()** <br>
AVG() will take the average of a numeric field.

**Question:** What is the average number of certifications students have completed?
<br>

In [51]:
from sqlalchemy import text

query = text("""
    SELECT 
        AVG(Certifications) AS Average_Certifications
    FROM skills;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result

   Average_Certifications
0                  2.5122

Although this query gives us a quick answer, as a stand alone data frame, it is not that useful. We can add it to our longer query above. <br><br>
**Aliases (AS)**
<br>
You can abbreviate your code to make it more visually appealing...or more confusing? :) <br>
<br>
Examples:<br>
FROM table_name t<br>
FROM table_name AS t<br>
<br>
**Objective:** Use abbreviations or aliases for all tables for the same code you wrote above (If you have not done so already). Be sure to obtain the same result set.

In [53]:
from sqlalchemy import text

query = text("""
    SELECT 
        a.Student_ID, 
        a.University_GPA, 
        s.Internships_Completed
    FROM academics AS a
    INNER JOIN skills AS s ON a.Student_ID = s.Student_ID
    WHERE a.University_GPA > 3.5;
""")

with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

  Student_ID  University_GPA  Internships_Completed
0     S00001            3.96                      3
1     S00002            3.63                      4
2     S00006            3.78                      2
3     S00007            3.83                      0
4     S00016            3.61                      3

Now we are starting to create multiple new fields that we can save any time as a .csv if needed to access later. Save your result set as a .csv:

In [55]:
# Save result set as .csv file:
result.to_csv("result_set.csv", index=False)

**DELETE** ~Caution!~
<br>
You can delete all records from specific tables or set a criteria to delete certain values or NULL values without deleting the table itself. It is okay if you do not execute the code if you have completed all data cleaning steps earlier in the semester.<br>
<br>
If you created autoincrement IDs for any of your data, it is recommended to use TRUNCATE TABLE instead, used the same way. The ID's will automatically reset if needed.<br>
<br>
**Objective:** Delete records from the academics table for students who are under the age of 18, as they may represent incomplete or invalid academic data.
<br>
**What table(s) are we deleting records from?** academics

In [24]:
# DELETE FROM academics
# WHERE Age < 18;
    
# I do not want to actually delete this, so I am not going to execute it :)

We can also delete entire tables in MySQL workbench by manually right clicking on the table and DROP TABLE. <br>
MySQL Workbench will prompt you to review the SQL syntax before dropping the table.<br>
The syntax is simple:<br>
DROP TABLE table_name<br>

In [58]:
#Close the database connection :)
connection.close()

**STOP**<br>
Before you submit, did you comment all your code?<br>
Did you answer all of the questions in the markdown cells?<br>
Did you rename the file and write your name at the top of the .pynb?<br>
Attach the .csv file you created with your Blackboard submission. It is preferred that you submit your Github link instead of the file itself.